doc/work.org
* Task 7
** DONE 支持数据库的重启恢复
   CLOSED: [2015-07-06 一 15:21]
** TODO 抓包只抓入口报文（挂起）
** DONE apache重定向
   CLOSED: [2015-07-06 一 15:21]
1. 使用php
** DONE 学习orgmode链接
   CLOSED: [2015-06-25 四 16:46]
[[http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html][TODO学习]]
** DONE qq在线表
   CLOSED: [2015-07-07 二 15:23]
   1. login，0x0001，"Log out"
    - update qq_session set T3=(select T2 from qq_session where mac=mac and qq=qq and t3 is null) 
      where mac=mac and qq=qq and T3 is null;
    - insert into qq_session values ();
 
   2. logout, 0x0062, "request log in"
    - update qq_session set T3=now where mac=mac and qq=qq and T3 is null;

   3. other
    - update qq_session set T2=now where mac=mac and qq=qq and T3 is null;
** DONE 重庆challenge一直已建立问题
   CLOSED: [2015-07-13 一 14:29]
  - 终端ip重复
** DONE AP的重定向携带url
   CLOSED: [2015-07-15 三 16:50]
** DONE 答复吴静流量字段
   CLOSED: [2015-07-13 一 14:29]
** DONE 外场杰赛认证繁忙问题（DHCP）
   CLOSED: [2015-07-16 四 16:56]
1. dhcp有问题，2.2.5.2-1496 版本vlan查询错误
   dhcp编译有问题：find . -type f |xargs file |grep CR|awk -F : '{print $1}'|xargs sed -i 's!\r!!' 
** TODO 微信信息截获
** DONE 广东portal推不出来帮助解决
   CLOSED: [2015-07-23 四 14:05]
   1. nat端口要放开

** DONE 外场杰赛没有话单
   CLOSED: [2015-07-16 四 16:56]
** DONE 中科新业对接安朗url携带广园信息
   CLOSED: [2015-07-28 二 09:23]
#	modified:   hr/ac_hr_func.c
#	modified:   hr/ac_hr_func.h
#	modified:   hr/ac_hr_main.c
#	modified:   powerac/usrm/ac_usrm_if.c
#	modified:   powerac/usrm/ac_usrm_public.h

** TODO 运营商携带apmac(待确认)
** TODO 审计功能需求
*** TODO URL过滤大量非主动性访问报文
*** TODO  
** TODO 运营商推不出portal
** TODO 中科新业问题？
** DONE 基于ac2780出hrd补丁，携带url
   CLOSED: [2015-07-28 二 18:09]
** DONE 吴静的account携带giga字段
   CLOSED: [2015-07-29 三 16:51]

* Task 8
** TODO 审计功能需求
*** TODO URL过滤大量非主动性访问报文
- 过滤方法：get
- 过滤格式：css/js/png/jpg/ico/gif
*** TODO HTTP整理
#+BEGIN_SRC sql
  create table HTTP_INFO {
  URL             varchar(255),
  METHOD          varchar(4),
  TITLE           varchar(64),
  POSTCONTENT     varchar(255),
  USERNAME        varchar(64),
  PASSWORD        varchar(64),
  KEYWORD         varchar(255),
  MAINFILE        varchar(255),
  FILESIZE        varchar(11)
  };
#+End_SRC
*** TODO QQ信息整理
#+BEGIN_SRC sql
  create table IM_MSG {
  IM_TYPE      varchar(32),
  USERNAME     varchar(64),
  PASSWORD     varchar(64),
  FROM_ID      varchar(64),
  TO_ID        varchar(64),
  CONTENT      varchar(255),
  ACTION       varchar(10),
  MAINFILE     varchar(255),
  FROMNICKNAME varchar(64),
  TONICKNAME   varchar(64)
  };
| IM_TYPE     | 1030001   |
| USERNAME    |           |
| PASSWORD    |           |
| FROM_ID     | QQ_number |
| TO_ID       |           |
| CONTENT     |           |
| ACTION      | COMMAND   |
| MAINFILE    |           |
| FROMNICNAME |           |
| TONICKNAME  |           |
#+END_SRC
