doc/work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>work</title>
<!-- 2015-08-04 Tue 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="高雅洁" />
</head>
<body>
<div id="content">
<h1 class="title">work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Task 7</a>
<ul>
<li><a href="#sec-1-1">1.1. <span class="done DONE">DONE</span> 支持数据库的重启恢复</a></li>
<li><a href="#sec-1-2">1.2. <span class="todo TODO">TODO</span> 抓包只抓入口报文（挂起）</a></li>
<li><a href="#sec-1-3">1.3. <span class="done DONE">DONE</span> apache重定向</a></li>
<li><a href="#sec-1-4">1.4. <span class="done DONE">DONE</span> 学习orgmode链接</a></li>
<li><a href="#sec-1-5">1.5. <span class="done DONE">DONE</span> qq在线表</a></li>
<li><a href="#sec-1-6">1.6. <span class="done DONE">DONE</span> 重庆challenge一直已建立问题</a></li>
<li><a href="#sec-1-7">1.7. <span class="done DONE">DONE</span> AP的重定向携带url</a></li>
<li><a href="#sec-1-8">1.8. <span class="done DONE">DONE</span> 答复吴静流量字段</a></li>
<li><a href="#sec-1-9">1.9. <span class="done DONE">DONE</span> 外场杰赛认证繁忙问题（DHCP）</a></li>
<li><a href="#sec-1-10">1.10. <span class="todo TODO">TODO</span> 微信信息截获</a></li>
<li><a href="#sec-1-11">1.11. <span class="done DONE">DONE</span> 广东portal推不出来帮助解决</a></li>
<li><a href="#sec-1-12">1.12. <span class="done DONE">DONE</span> 外场杰赛没有话单</a></li>
<li><a href="#sec-1-13">1.13. <span class="done DONE">DONE</span> 中科新业对接安朗url携带广园信息</a></li>
<li><a href="#sec-1-14">1.14. <span class="todo TODO">TODO</span> 运营商携带apmac(待确认)</a></li>
<li><a href="#sec-1-15">1.15. <span class="todo TODO">TODO</span> 审计功能需求</a>
<ul>
<li><a href="#sec-1-15-1">1.15.1. <span class="todo TODO">TODO</span> URL过滤大量非主动性访问报文</a></li>
<li><a href="#sec-1-15-2">1.15.2. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
<li><a href="#sec-1-16">1.16. <span class="todo TODO">TODO</span> 运营商推不出portal</a></li>
<li><a href="#sec-1-17">1.17. <span class="todo TODO">TODO</span> 中科新业问题？</a></li>
<li><a href="#sec-1-18">1.18. <span class="done DONE">DONE</span> 基于ac2780出hrd补丁，携带url</a></li>
<li><a href="#sec-1-19">1.19. <span class="done DONE">DONE</span> 吴静的account携带giga字段</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Task 8</a>
<ul>
<li><a href="#sec-2-1">2.1. <span class="todo TODO">TODO</span> 审计功能需求</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. <span class="todo TODO">TODO</span> URL过滤大量非主动性访问报文</a></li>
<li><a href="#sec-2-1-2">2.1.2. <span class="todo TODO">TODO</span> HTTP整理</a></li>
<li><a href="#sec-2-1-3">2.1.3. <span class="todo TODO">TODO</span> QQ信息整理</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Task 7</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> 支持数据库的重启恢复</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> 抓包只抓入口报文（挂起）</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> apache重定向</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>使用php
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> 学习orgmode链接</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html">TODO学习</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> qq在线表</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>login，0x0001，"Log out"
<ul class="org-ul">
<li>update qq_session set T3=(select T2 from qq_session where mac=mac and qq=qq and t3 is null) 
where mac=mac and qq=qq and T3 is null;
</li>
<li>insert into qq_session values ();
</li>
</ul>
</li>

<li>logout, 0x0062, "request log in"
<ul class="org-ul">
<li>update qq_session set T3=now where mac=mac and qq=qq and T3 is null;
</li>
</ul>
</li>

<li>other
<ul class="org-ul">
<li>update qq_session set T2=now where mac=mac and qq=qq and T3 is null;
</li>
</ul>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="done DONE">DONE</span> 重庆challenge一直已建立问题</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>终端ip重复
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> AP的重定向携带url</h3>
<div class="outline-text-3" id="text-1-7">
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> 答复吴静流量字段</h3>
<div class="outline-text-3" id="text-1-8">
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> <span class="done DONE">DONE</span> 外场杰赛认证繁忙问题（DHCP）</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>dhcp有问题，2.2.5.2-1496 版本vlan查询错误
dhcp编译有问题：find . -type f |xargs file |grep CR|awk -F : '{print $1}'|xargs sed -i 's!\r!!' 
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> <span class="todo TODO">TODO</span> 微信信息截获</h3>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> <span class="done DONE">DONE</span> 广东portal推不出来帮助解决</h3>
<div class="outline-text-3" id="text-1-11">
<ol class="org-ol">
<li>nat端口要放开
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> <span class="done DONE">DONE</span> 外场杰赛没有话单</h3>
<div class="outline-text-3" id="text-1-12">
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> <span class="done DONE">DONE</span> 中科新业对接安朗url携带广园信息</h3>
<div class="outline-text-3" id="text-1-13">
<p>
#        modified:   hr/ac_hr_func.c
#        modified:   hr/ac_hr_func.h
#        modified:   hr/ac_hr_main.c
#        modified:   powerac/usrm/ac_usrm_if.c
#        modified:   powerac/usrm/ac_usrm_public.h
</p>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> <span class="todo TODO">TODO</span> 运营商携带apmac(待确认)</h3>
</div>
<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> <span class="todo TODO">TODO</span> 审计功能需求</h3>
<div class="outline-text-3" id="text-1-15">
</div><div id="outline-container-sec-1-15-1" class="outline-4">
<h4 id="sec-1-15-1"><span class="section-number-4">1.15.1</span> <span class="todo TODO">TODO</span> URL过滤大量非主动性访问报文</h4>
</div>
<div id="outline-container-sec-1-15-2" class="outline-4">
<h4 id="sec-1-15-2"><span class="section-number-4">1.15.2</span> <span class="todo TODO">TODO</span> </h4>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> <span class="todo TODO">TODO</span> 运营商推不出portal</h3>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> <span class="todo TODO">TODO</span> 中科新业问题？</h3>
</div>
<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> <span class="done DONE">DONE</span> 基于ac2780出hrd补丁，携带url</h3>
<div class="outline-text-3" id="text-1-18">
</div>
</div>
<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> <span class="done DONE">DONE</span> 吴静的account携带giga字段</h3>
<div class="outline-text-3" id="text-1-19">
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Task 8</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> 审计功能需求</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> URL过滤大量非主动性访问报文</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>过滤方法：get
</li>
<li>过滤格式：css/js/png/jpg/ico/gif
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> HTTP整理</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-sql">create table HTTP_INFO {
URL             varchar(255),
METHOD          varchar(4),
TITLE           varchar(64),
POSTCONTENT     varchar(255),
USERNAME        varchar(64),
PASSWORD        varchar(64),
KEYWORD         varchar(255),
MAINFILE        varchar(255),
FILESIZE        varchar(11)
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> <span class="todo TODO">TODO</span> QQ信息整理</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">

<pre class="src src-sql">  create table IM_MSG {
  IM_TYPE      varchar(32),
  USERNAME     varchar(64),
  PASSWORD     varchar(64),
  FROM_ID      varchar(64),
  TO_ID        varchar(64),
  CONTENT      varchar(255),
  ACTION       varchar(10),
  MAINFILE     varchar(255),
  FROMNICKNAME varchar(64),
  TONICKNAME   varchar(64)
  };
| IM_TYPE     | 1030001   |
| USERNAME    |           |
| PASSWORD    |           |
| FROM_ID     | QQ_number |
| TO_ID       |           |
| CONTENT     |           |
| ACTION      | COMMAND   |
| MAINFILE    |           |
| FROMNICNAME |           |
| TONICKNAME  |           |
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 高雅洁</p>
<p class="date">Created: 2015-08-04 Tue 17:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
